{
  "backend/main.mo": "Main Motoko actor implementing video management system with authorization, blob storage, user profiles, video CRUD operations, engagement tracking, and admin-only functions for adding videos and viewing analytics.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of the header logo image in the Layout component with a neon green arrow design showing 'LEARNING VIDEOS' text.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, utilities, and configuration for the Learning Videos application.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with funky vibrant chart colors (hot pink, lime green, orange, purple, cyan) for light and dark modes.",
  "frontend/index.html": "HTML entry point with page title 'Learning Videos' and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for video list, admin panel, and admin dashboard, wrapped in ThemeProvider with ProfileSetupModal and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-screen access denied component with shield icon and navigation button for unauthorized users attempting to access admin-only pages.",
  "frontend/src/components/EngagementTable.tsx": "Card-based table component displaying user engagement records with filtering options by video/user and colorful status badges for watched, watch later, and not interested.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header containing neon green arrow logo image at /assets/1771767120748.png, responsive navigation menu with admin links, mobile menu toggle, login button, and footer with caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity hook to handle login/logout with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and save it. Prevents closing until profile is created.",
  "frontend/src/components/StatusButton.tsx": "Reusable button component with three visual variants (watched, later, skip) that shows a checkmark when selected and applies variant-specific styling.",
  "frontend/src/components/ThumbnailPreview.tsx": "Displays a video thumbnail preview in a card with fallback UI showing an ImageOff icon when no thumbnail is available.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video information with thumbnail, title, date badge, and three status buttons (watched, watch later, not interested) that update user video status.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes and initializing access control with admin token from URL params.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profile, video management, video status tracking, and admin dashboard data fetching.",
  "frontend/src/hooks/useUserRole.ts": "Hook that fetches and returns the current user's role and admin status from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays engagement metrics (total videos, total engagements) and an engagement table showing which users watched which videos. Includes role-based access control and loading/error states.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page for adding new videos with URL input, automatic thumbnail generation from YouTube/Instagram links, and title entry. Includes form validation and success/error toast notifications.",
  "frontend/src/pages/VideoList.tsx": "Main video feed page that displays all videos in a scrollable list with authentication check. Shows loading states, error handling, and empty state when no videos exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/src/utils/videoUrlParser.ts": "Utility functions to extract video IDs from YouTube and Instagram Reel URLs, generate YouTube thumbnail URLs, and validate video URL formats.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with chart colors, sidebar colors, custom animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking the app's purpose (learning video engagement tracker), architectural notes, and completed features including admin authentication, video management, status tracking, and dashboard views."
}